In [1]:
import pandas as pd

In [2]:
obj = pd.Series([3,4,5,2])

obj

0    3
1    4
2    5
3    2
dtype: int64

In [3]:
obj.values

array([3, 4, 5, 2], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([3,3,5,6], index = ['a','b','c','d'])

obj2

a    3
b    3
c    5
d    6
dtype: int64

In [6]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
3 in obj

True

In [8]:
states = ['Caobj4 = pd.Series(sdata, index=states)lifornia', 'Ohio', 'Oregon', 'Texas']

In [10]:
obj4 = pd.Series(states, index=states)

In [11]:
obj4

California    California
Ohio                Ohio
Oregon            Oregon
Texas              Texas
dtype: object

In [12]:
pd.isnull(obj4)

California    False
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [13]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [14]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [15]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [17]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [19]:
data = {'Name':['a', 'b', 'c', 'd'],
        'Age':[2, 23, 4, 4],
        'Address':['aa', 'bb', 'cc', 'dd']}
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
 
df

  Name  Age Address
0    a    2      aa
1    b   23      bb
2    c    4      cc
3    d    4      dd

In [20]:
df.head

<bound method NDFrame.head of   Name  Age Address
0    a    2      aa
1    b   23      bb
2    c    4      cc
3    d    4      dd>

In [21]:
df.info

<bound method DataFrame.info of   Name  Age Address
0    a    2      aa
1    b   23      bb
2    c    4      cc
3    d    4      dd>

In [24]:
df.tail

<bound method NDFrame.tail of   Name  Age Address
0    a    2      aa
1    b   23      bb
2    c    4      cc
3    d    4      dd>

In [25]:
df.describe()

             Age
count   4.000000
mean    8.250000
std     9.878428
min     2.000000
25%     3.500000
50%     4.000000
75%     8.750000
max    23.000000